<a href="https://colab.research.google.com/github/JeisonTantachuco/curso-series-temporales/blob/master/2.%20Serie%20temporal%20en%20R%20y%20Python/Python/2_Python_Objeto_serie_temporal.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Importing the Packages

In [1]:
import pandas as pd
import numpy as np

### Importing the data

In [2]:
raw_csv_data = pd.read_csv("https://raw.githubusercontent.com/JeisonTantachuco/curso-series-temporales/master/1.%20Introduccion%20a%20las%20series%20temporales/Python/Index2018.csv") 
df_comp=raw_csv_data.copy()

### Lenght of the Time Period

In [3]:
df_comp.describe()

               spx           dax         ftse        nikkei
count  6269.000000   6269.000000  6269.000000   6269.000000
mean   1288.127542   6080.063363  5422.713545  14597.055700
std     487.586473   2754.361032  1145.572428   4043.122953
min     438.920000   1911.700000  2876.600000   7054.980000
25%     990.671905   4069.350000  4486.100000  10709.290000
50%    1233.420000   5773.340000  5662.430000  15028.170000
75%    1459.987747   7443.070000  6304.250000  17860.470000
max    2872.867839  13559.600000  7778.637689  24124.150000

In [4]:
df_comp.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [5]:
df_comp.date.describe() #obligamos que nos haga un describe a la variable fecha
#nos dice cuantos valores hay, cuantos valores unicos
#Python ve la columna de estos datos como un string, no como una fecha, por eso en "top" simplemente pone un valor cualquiera
#porque entiende que todos los valores de dicha columna son iguales.

count           6269
unique          6269
top       18/05/2001
freq               1
Name: date, dtype: object

### From Text to Date

In [6]:
df_comp.date = pd.to_datetime(df_comp.date, dayfirst = True)
# convertiremos el tipo de dato a datetime
# dayfirst=True, ya que el método tradicionalmente lo pone como False, eso quiere decir que el primer número que leera será el mes luego el dia luego el año.
# Al ponerlo en True, estamos afirmando que nosotros tenemos los valores ordenados dia-mes-año

In [7]:
df_comp.head() #vemos que ahora la representación ha cambiado a año-mes-dia

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [8]:
df_comp.date.describe() #describiremos ahora la variable date
# ahora como ha cambiado a tipo fecha, la descripción sera correcta
# top sigue siendo una fecha cualquiera, sin embargo first nos indica la primera fecha y last la última

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

### Setting the Index

In [9]:
df_comp.set_index("date", inplace=True)
# Colocaremos la columna date (de fechas), como indice para al plotear salga en el eje X
# inplace=True, para que la columna date quede como índice, y no lo considere nuevamente como valor

In [10]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

In [ ]:
#df_comp.date.describe() #Expect to get an error message because we no longer have a "date" column since it is the index
# Nos botará un error ya que la columna date ya no pertenece al data frame como dato, sino está como índice.
# Y a un índice no se le puede aplicar el método describe.
# Tener en cuenta que antes de convertir a índice debemos verificar que todas las fechas estén bien escritas ya que como índice no puede haber una modificación

### Setting the Desired Frequency

In [ ]:
df_comp=df_comp.asfreq('d')

In [ ]:
df_comp.head()

In [ ]:
df_comp=df_comp.asfreq('b')

In [ ]:
df_comp.head()

### Handling Missing Values

In [ ]:
df_comp.isna()

In [ ]:
df_comp.isna().sum()

In [ ]:
df_comp

In [ ]:
df_comp.spx=df_comp.spx.fillna(method='ffill')

In [ ]:
df_comp.isna().sum()

In [ ]:
df_comp.ftse=df_comp.ftse.fillna(method='bfill')

In [ ]:
df_comp.dax=df_comp.dax.fillna(value = df_comp.dax.mean())

In [ ]:
df_comp.nikkei=df_comp.dax.fillna(method='bfill')

In [ ]:
df_comp.isna().sum()

### Simplifying the Dataset

In [ ]:
df_comp['market_value']=df_comp.spx

In [ ]:
df_comp.describe()

In [ ]:
del df_comp['spx']

In [ ]:
df_comp.describe()

In [ ]:
del df_comp['dax']
del df_comp['ftse']
del df_comp['nikkei']

In [ ]:
df_comp.describe()

### Splitting the Data

In [ ]:
size = int(len(df_comp)*0.8)

In [ ]:
df = df_comp.iloc[:size]

In [ ]:
df_test = df_comp.iloc[size:]

In [ ]:
df.tail()

In [ ]:
df_test.head()